[
  {
    "_id": "616af7c07b6a3d1696aef4d0",
    "index": 0,
    "salary": 50000,
    "picture": "https://i0.wp.com/www.rankred.com/wp-content/uploads/2019/07/David-Patterson.jpg?w=700&ssl=1",
    "age": 45,
    "name": "David Patterson",
    "expertice": "Patterson is known for his contribution to the RISC processor (Reduced Instruction Set Computer) design, and his research on RAID (Redundant Arrays of Independent Disks) and NOW (Network of Workstations).",
    "language": "Python,C,php",
    "phone": "+1 (802) 548-2036",
    "email": "davidpatterson@opticom.com",
    "address": "618 Henry Street, Flintville, Ohio, 3832",
    "about": "David Patterson is a computer scientist and professor at the University of California, Berkeley.\r\n",
    "achievements": " He received the Eckert–Mauchly Award, Karl Karlstrom, Outstanding Educator, and ACM Distinguished Service Award.\r\n"
  },
  {
    "_id": "616af7c003ca1b1ed76edfdb",
    "index": 1,
    "salary": 110000,
    "picture": "https://i2.wp.com/www.rankred.com/wp-content/uploads/2019/07/John-Carmack.jpg?w=700&ssl=1",
    "age": 50,
    "name": "John Carmack",
    "expertice": "He was the lead programmer of the Id video games Doom, Rage, Commander Keen, and their sequels. He is best known for his innovations in 3d graphics, especially for Reverse algorithm for shadow volumes. Carmack popularized the use of several techniques in computer graphics such as adaptive tile refresh, binary space partitioning, raycasting, surface caching, and MegaTexture technology.\r\n",
    "language": "Python,c++,.net",
    "email": "johncarmack@opticom.com",
    "phone": "+1 (878) 426-2874",
    "address": "128 Coleridge Street, Beyerville, North Dakota, 6198",
    "about": "John Carmack is a game developer and co-founder and former technical director of Id Software.\r\n",
    "achievements": " He was honored by the National Academy of Television Arts & Sciences (twice), the Technology & Engineering Emmy Awards, and Game Developers Conference Lifetime Achievement award for his pioneering work.\r\n"
  },
  {
    "_id": "616af7c0e05d177ac9b76543",
    "index": 2,
    "salary": 65000,
    "picture": "https://i2.wp.com/www.rankred.com/wp-content/uploads/2019/07/Guido-van-Rossum.jpg?w=700&ssl=1",
    "age": 31,
    "name": "Guido van Rossum",
    "expertice": "In the early days, he wrote a glob() routine to BSD Unix and worked on ABC programming language. He developed Python while working for Google and continues to oversee the Python development process, making essential decisions where necessary.\r\n",
    "language": "R,Python,Typescript",
    "phone": "+1 (805) 559-3659",
    "email": "guidovanrossum@opticom.com",
    "achievements": "Rossum received an NLUUG Award, the 2001 Award for the Advancement of Free Software for his work on Python.\r\n",
    "address": "783 Alabama Avenue, Elwood, New Mexico, 9044",
    "about": "Guido van Rossum is a computer programmer, known as the author of the Python programming language.\r\n"
  },
  {
    "_id": "616af7c012493ec2f4fbc5cd",
    "index": 3,
    "salary": 30000,
    "picture": "https://i2.wp.com/www.rankred.com/wp-content/uploads/2019/07/James-Arthur-Gosling.jpg?w=700&ssl=1",
    "age": 28,
    "name": "James Arthur Gosling",
    "language": "Javascript,Typescript",
    "email": "jamesarthurgosling@opticom.com",
    "phone": "+1 (805) 534-2299",
    "address": "391 Nevins Street, Clayville, Michigan, 4296",
    "about": "James Gosling is a Canadian computer scientist, known as the father of the Java programming language.\r\n",
    "expertice": "James developed a multi-processor version of Unix, several compilers, and mail systems before joining Sun Microsystems. He invented the Java programming language and implemented Java’s original compiler and virtual machine in 1994. He also made contributions to several other software systems, including Gosling Emacs and NeWS.\r\n",

    "achievements": " Gosling was awarded The Economist Innovation Award,  IEEE John von Neumann Medal, and he was made an Officer of the Order of Canada in 2007.\r\n"
  },
  {
    "_id": "616af7c0f8749af1d1db13d8",
    "index": 4,
    "salary": 55000,
    "picture": "https://i2.wp.com/www.rankred.com/wp-content/uploads/2019/07/Alan-Curtis-Kay.jpg?w=700&ssl=1",
    "age": 54,
    "name": "Alan Curtis Kay",
    "expertice": "Alan is best known for his early pioneering work on object-oriented programming and windowing Graphical User Interface (GUI) design. Brian is also the coiner of phase: The best way to predict the future is to invent it.\r\n",
    "language": "Linux,Java,Python",
    "phone": "+1 (951) 578-2738",
    "email": "alancurtiskay@opticom.com",
    "address": "930 Seabring Street, Kula, Kentucky, 2261",
    "about": "Alan Curtis Kay is a computer scientist who has been elected a Fellow of the National Academy of Engineering, the American Academy of Arts and Sciences and the Royal Society of Arts.\r\n",
    "achievements": "Alan received ACM Turing Award for his work on object-oriented programming, UPE Abacus Award, and UdK 01-Award  for pioneering the GUI.\r\n"
  },
  {
    "_id": "616af7c04957a616ccb05844",
    "index": 5,
    "salary": 75000,
    "picture": "https://i2.wp.com/www.rankred.com/wp-content/uploads/2019/07/John-McCarthy.jpg?w=700&ssl=1",
    "age": 47,
    "name": "John McCarthy",
    "expertice": "John developed the Lisp programming language family, popularized timesharing, and worked on the design of the ALGOL programming language. He invented the Garbage Collection method to solve the problem of Lisp, which later became the programming language of choice for AI applications.\r\n",
    "language": "java,c++,c",
    "phone": "+1 (994) 570-2002",
    "email": "johnmccarthy@opticom.com",
    "address": "490 Cass Place, Dennard, Alabama, 9866",
    "about": "John McCarthy was a cognitive scientist and computer scientist, who coined the term Artificial Intelligence.\r\n",
    "achievements": "He was honored with the Turing Award, Kyoto Prize, National Medal of Science, Computer Pioneer Award, and IJCAI Award for Research Excellence.\r\n"
  },
  {
    "_id": "616af7c022d92b55ef68d269",
    "index": 6,
    "salary": 42000,
    "picture": "https://i0.wp.com/www.rankred.com/wp-content/uploads/2019/07/Bill-Gates.jpg?w=700&ssl=1",
    "age": 56,
    "name": "Bill Gates",
    "expertice": "For the first five years at Microsoft, Gates personally oversaw every single line of code that the company sent out, often fixing ones he deemed buggy or incorrect. In the early days, he and Paul Allen wrote a full BASIC language interpreter in assembly language for a computer they didn’t even have access to, which had only 4k bytes of memory. They wrote it on PDP-10 running on Intel 8080 emulator.",
    "language": "R,Python,Typescript",
    "phone": "+1 (936) 563-2177",
    "email": "billgates@opticom.com",
    "address": "801 Tapscott Avenue, Coldiron, Oklahoma, 3179",
    "about": "The man who needs no introduction. How could I leave out the world’s richest programmer whose software is used by the whole world?\r\n",
    "achievements": "He was honored with the National Medal of Technology and Innovation, Distinguished Fellow of the British Computer Society, and Bower Award for Business Leadership.\r\n"
  },
  {
    "_id": "616af7c03beec02b7488308f",
    "index": 7,
    "salary": 39000,
    "picture": "https://i2.wp.com/www.rankred.com/wp-content/uploads/2019/07/Brian-Kernighan.jpg?w=700&ssl=1",
    "name": "Brian Kernighan",
    "expertice": " He developed Unix OS with Dennis Ritchie and Ken Thompson. He authored numerous Unix programs, including cron and ditroff for Version 7. Kernighan is a coauthor of AMPL and AWK programming language.Brian is also the coiner of the well-known expression “What You See Is All You Get”(WYSIAYG).\r\n",
    "language": "Python,Typescript",
    "phone": "+1 (944) 458-3952",
    "email": "briankernighan@opticom.com",
    "age": 40,
    "address": "982 Fay Court, Layhill, Virgin Islands, 7735",
    "about": "Brian Kernighan is a computer scientist who worked at Bell Labs. Early in his career, he was a software editor for Prentice-Hall International.\r\n",
    "achievements": "He won INFORMS Computing Society Prize in 1993 and received many Teacher Awards throughout his career.\r\n"
  },
  {
    "_id": "616af7c092b8a53225502027",
    "index": 8,
    "salary": 41000,
    "picture": "https://i1.wp.com/www.rankred.com/wp-content/uploads/2019/07/Ken-Thompson.jpg?w=600&ssl=1",
    "name": "Ken Thompson",
    "expertice": "Thompson developed the original Unix OS with Ritchie. He invented the B programming language and was one of the early developers of the Plan 9 operating system.\r\n",
    "language": "php,javascript,python",
    "phone": "+1 (867) 490-2166",
    "email": "kenthompson@opticom.com",
    "age": 58,
    "address": "982 Fay Court, Melborne, Austilia, 7735",
    "about": "Ken Thompson is a pioneer of the computer science and hacker community. He is best known for designing and implementing the Unix operating system.\r\n",
    "achievements": "He was honored with the Turing Award, Japan Prize, IEEE Emanuel R. Piore Award, Computer Pioneer Award, and National Medal of Technology.\r\n"
  }
]
